app/controllers/coaches_controller.rb

  def index
    @coaches = Coach.all
---
SELECT * FROM "coaches"

  def show
    @coach = Coach.find(params[:id])
---
SELECT * FROM "coaches" WHERE ("coaches"."id" = 1)

  def create
    @coach = Coach.new(params[:coach])
    if @coach.save
---
INSERT INTO "coaches" ("name", "created_at", "updated_at", "phone", "description") VALUES('Aviv', '2010-08-02 13:09:00', '2010-08-02 13:09:00', '', '')