app/controllers/event_types_controller.rb

  def index
    @event_types = EventType.all
---
SELECT * FROM "event_types"

  def show
    @event_type = EventType.find(params[:id])
---
SELECT * FROM "event_types" WHERE ("event_types"."id" = 1)

  def create
    @event_type = EventType.new(params[:event_type])
    if @event_type.save
---
INSERT INTO "event_types" ("name", "created_at", "updated_at") VALUES('WOD', '2010-08-01 03:25:45', '2010-08-01 03:25:45')