app/controllers/events_controller.rb

  def populate
    inspection_date = Date.parse(params[:id])
    month = inspection_date.month
    year = inspection_date.year
    TimeSlot.all.each do |ts|
      hour, min = ts.start_time.hour, ts.start_time.min
      (inspection_date.beginning_of_month.day..inspection_date.end_of_month.day).to_a.each do |day|
        start_time = Time.local(year,month,day,hour,min,0)   #=> Sat Jan 01 20:15:01 CST 2000
        if date_match(ts,start_time.strftime('%A'))
          e = Event.new
          e.start_time = start_time
          e.end_time = Time.local(year,month,day,hour+1,min,0)   #=> Sat Jan 01 20:15:01 CST 2000
          e.event_type = ts.event_type
          e.title = ts.title
          e.save!
---
SELECT * FROM "time_slots"
INSERT INTO "events" ("end_time", "time_slot_id", "created_at", "event_series_id", "title", "updated_at", "event_type_id", "description", "start_time", "all_day") VALUES('2010-08-02 07:00:00', 1, '2010-08-02 01:14:36', NULL, '6AM WOD', '2010-08-02 01:14:36', 1, NULL, '2010-08-02 06:00:00', 'f')

  def empty_out_month
    inspection_date = Date.parse(params[:id])
    ids = Event.all.select{|e| e.start_time.to_date >= inspection_date.beginning_of_month && e.start_time.to_date <= inspection_date.end_of_month}.map{|e| e.id}
    Event.destroy(ids)
---
SELECT * FROM "events"
DELETE FROM "events" WHERE "id" = 94

  def get_events
    @events = Event.find(:all, :conditions => ["start_time >= '#{Time.at(params['start'].to_i).to_formatted_s(:db)}' and end_time <= '#{Time.at(params['end'].to_i).to_formatted_s(:db)}'"] )
    events = []
    @events.each do |event|
---
SELECT * FROM "events" WHERE (start_time >= '2010-08-01 00:00:00' and end_time <= '2010-08-08 00:00:00')
SELECT * FROM "events"

  def move
    @event = Event.find_by_id params[:id]
    if @event
      @event.start_time = (params[:minute_delta].to_i).minutes.from_now((params[:day_delta].to_i).days.from_now(@event.start_time))
      @event.end_time = (params[:minute_delta].to_i).minutes.from_now((params[:day_delta].to_i).days.from_now(@event.end_time))
      @event.all_day = params[:all_day]
      @event.save
---
SELECT * FROM "events" WHERE ("events"."id" = '1') LIMIT 1
UPDATE "events" SET "start_time" = '2010-09-02 05:30:00', "updated_at" = '2010-08-01 18:08:45', "end_time" = '2010-09-02 06:30:00' WHERE "id" = 247

  def edit
    @event = Event.find_by_id(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = '1') LIMIT 1

  def update
    @event = Event.find_by_id(params[:event][:id])
    @event.attributes = params[:event]
    @event.save
---
SELECT * FROM "events" WHERE ("events"."id" = '1') LIMIT 1
UPDATE "events" SET "updated_at" = '2010-08-01 02:45:57', "title" = 'going to the park with sue' WHERE "id" = 1

  def destroy
    @event = Event.find_by_id(params[:id])
    @event.destroy
---
SELECT * FROM "events" WHERE ("events"."id" = '1') LIMIT 1
DELETE FROM "events" WHERE "id" = 1

  def payroll
    @month = params[:id] ? Date.parse(params[:id]) : Date.today
    @months = Event.months_available
    @coaches = []
    Coach.all.each do |t|
      @coaches << [t.name, t.blocks_this_month(@month)]
    end
    @types = EventType.all.map{|et| et.name}
---
SELECT * FROM "coaches"
SELECT * FROM "event_types"