app/controllers/events_controller.rb

SELECT * FROM "event_types" LIMIT 1
---
  def populate
    inspection_date = Date.today
    month = inspection_date.month
    year = inspection_date.year
    TimeSlot.all.each do |ts|
      hour, min = ts.start_time.hour, ts.start_time.min
      (inspection_date.beginning_of_month.day..inspection_date.end_of_month.day).to_a.each do |day|
        start_time = Time.local(year,month,day,hour,min,0)   #=> Sat Jan 01 20:15:01 CST 2000
        if date_match(ts,start_time.strftime('%A'))
          e = Event.new
          e.start_time = start_time
          e.end_time = Time.local(year,month,day,hour+1,min,0)   #=> Sat Jan 01 20:15:01 CST 2000
          e.time_slot_id = ts.id
          e.event_type = EventType.first

SELECT * FROM "trainers"
---
  def payroll
    @trainers = []
    Trainer.all.each do |t|