app/controllers/interface_controller.rb

SELECT * FROM "meetings"
---
  def index
    @meetings = Meeting.all