app/controllers/meeting_types_controller.rb

SELECT * FROM "meeting_types"
---
  def index
    @meeting_types = MeetingType.all

SELECT * FROM "meeting_types" WHERE ("meeting_types"."id" = 1)
---
  def show
    @meeting_type = MeetingType.find(params[:id])

INSERT INTO "meeting_types" ("name", "created_at", "updated_at") VALUES('Elements', '2010-07-30 01:31:53', '2010-07-30 01:31:53')
---
  def create
    @meeting_type = MeetingType.new(params[:meeting_type])
    if @meeting_type.save