app/controllers/meetings_controller.rb

SELECT * FROM "meetings"
---
  def index
    @meetings = Meeting.all

SELECT * FROM "meetings" WHERE ("meetings"."id" = 1)
---
  def show
    @meeting = Meeting.find(params[:id])

INSERT INTO "meetings" ("duration", "time_slot_id", "created_at", "trainer_meeting_id", "updated_at", "meeting_date", "event_type_id") VALUES(60.0, 2, '2010-07-30 01:40:58', NULL, '2010-07-30 01:40:58', '2005-01-05', 1)
---
  def create
    @meeting = Meeting.new(params[:meeting])
    if @meeting.save

SELECT * FROM "meetings" WHERE ("meetings".event_type_id = 1)
---
  def edit
    @meeting = Meeting.find(params[:id])

SELECT * FROM "meetings" WHERE ("meetings"."id" = 1)
UPDATE "meetings" SET "updated_at" = '2010-07-30 02:32:31', "meeting_date" = '2010-01-05' WHERE "id" = 1
---
  def update
    @meeting = Meeting.find(params[:id])
    if @meeting.update_attributes(params[:meeting])