app/controllers/time_slots_controller.rb

  def index
    @time_slots = TimeSlot.all
---
SELECT * FROM "time_slots"

  def show
    @time_slot = TimeSlot.find(params[:id])
---
SELECT * FROM "time_slots" WHERE ("time_slots"."id" = 1)

  def create
    @time_slot = TimeSlot.new(params[:time_slot])
    if @time_slot.save
---
INSERT INTO "time_slots" ("friday", "created_at", "title", "tuesday", "wednesday", "updated_at", "monday", "saturday", "sunday", "thursday", "event_type_id", "start_time") VALUES('t', '2010-08-01 17:14:26', 'Foo', 'f', 't', '2010-08-01 17:14:26', 't', 'f', 'f', 'f', NULL, '2001-01-01 06:00:00')

  def edit
    @time_slot = TimeSlot.find(params[:id])
---
SELECT * FROM "time_slots" WHERE ("time_slots"."id" = 1)

  def update
    @time_slot = TimeSlot.find(params[:id])
    if @time_slot.update_attributes(params[:time_slot])
---
SELECT * FROM "time_slots" WHERE ("time_slots"."id" = 1)
UPDATE "time_slots" SET "start_time" = '2000-01-01 06:00:00', "updated_at" = '2010-07-31 15:59:08', "tuesday" = 't', "wednesday" = 't', "thursday" = 't' WHERE "id" = 1

  def destroy
    @time_slot = TimeSlot.find(params[:id])
    @time_slot.destroy
---
SELECT * FROM "time_slots" WHERE ("time_slots"."id" = 3)
DELETE FROM "time_slots" WHERE "id" = 3