app/controllers/trainers_controller.rb

  def index
    @coachs = Trainer.all
---
SELECT * FROM "trainers"

  def show
    @coach = Trainer.find(params[:id])
---
SELECT * FROM "trainers" WHERE ("trainers"."id" = 1)

  def create
    @coach = Trainer.new(params[:coach])
    if @coach.save
---
INSERT INTO "trainers" ("name", "created_at", "updated_at", "phone", "description") VALUES('Aviv', '2010-07-30 00:55:14', '2010-07-30 00:55:14', '937-282-2882', 'Strong but gentle')

  def edit
    @coach = Trainer.find(params[:id])
---
SELECT * FROM "trainers" WHERE ("trainers"."id" = 1)

  def update
    @coach = Trainer.find(params[:id])
    if @coach.update_attributes(params[:coach])
---
SELECT * FROM "trainers" WHERE ("trainers"."id" = 1)
UPDATE "trainers" SET "updated_at" = '2010-07-30 02:37:58', "name" = '' WHERE "id" = 1